{"data":{"introduction":{"html":"<p><span class=\"first-line\"><span class=\"first-letter\">JavaScript</span> est en mouvement constant.</span> De nouvelles librairies, de nouveaux frameworks, langages… Cela fait en quelque sorte <em>partie du fun</em>, mais cela peut devenir épuisant.</p>\n<p>C'est là tout l'intérêt du sondage <em>State of JavaScript</em> : cette année, nous avons sondé plus de 20 000 développeurs JavaScript pour discerner ce qu'ils utilisent, ce qu'ils apprécient, et ce qu'ils comptent apprendre. Le résultat est une collection de statistiques unique qui, on l'espère, vous aidera à trouver votre chemin à travers l'écosystème JavaScript.</p>\n<p>Si vous souhaitez en savoir plus sur les nouveautés de cette année,\nnous vous invitons à consulter <a href=\"https://medium.freecodecamp.org/the-state-of-javascript-2018-8322bcc51bd8\">ce post</a> pour plus de détails.</p>\n<h3>Ressources</h3>\n<p>Nous supposons qu'une grande partie d'entre vous consulte ces résultats afin de décider quelles technologies apprendre. Nous avons donc inclus des liens vers des ressources JavaScript utiles à travers le sondage pour vous aiguiller dans la bonne direction.</p>\n<p>Par souci de transparence nous devons aussi préciser que certains de ces liens sont issus de partenariats payants; mais quoi qu'il en soit ce sont toutes des ressources de bonne qualité fournies par des gens que nous apprécions et qui ont décidé de soutenir ce projet.</p>\n<h3>L'Équipe</h3>\n<p>Le sondage <strong>State of JavaScript</strong> est créé et maintenu par :</p>\n<ul>\n<li><a href=\"https://twitter.com/sachagreif\">Sacha Greif</a> (moi!): Design, rédaction, code</li>\n<li><a href=\"https://twitter.com/benitteraphael\">Raphael Benitte</a>: Analyse des données, visualisations</li>\n<li><a href=\"https://twitter.com/michaelrambeau\">Michael Rambeau</a>: Rédaction, statistiques additionnelles</li>\n</ul>\n<p>N'hésitez pas à jeter un œil à mon framework JavaScript basé sur React/GraphQL: <a href=\"http://vulcanjs.org\">Vulcan.js</a>, ainsi que la librairie React de dataviz de Raphaël: <a href=\"https://nivo.rocks\">nivo</a>, ou encore le site de Michael référençant les librairies Javascript: <a href=\"https://bestofjs.org\">Best of JS</a>.</p>\n<h3>Autres Liens</h3>\n<ul>\n<li><a href=\"https://stateofjs.com\">La page d'accueil de State of JavaScript</a></li>\n<li><a href=\"https://2016.stateofjs.com/\">2016</a></li>\n<li><a href=\"https://2017.stateofjs.com/\">2017</a></li>\n</ul>\n<h3>Crédits &#x26; Autres</h3>\n<p>La police utilisée sur ce site est la police IBM Plex Mono.\nLe gif en feu vient quant à lui d'<a href=\"https://animal-jam-roleplay.wikia.com/wiki/File:Pixel-fire-gif-1.gif\">Animal Jam</a>.</p>\n<p>Une question ? Une remarque ? Vous souhaitez accéder aux données brutes ? <a href=\"mailto:hello@stateofjs.com\">Contactez nous!</a></p>\n<p>Et maintenant, voyons voir ce qu'il s'est passé cette année dans l'écosystème JavaScript !</p>\n<p>P.S. Nous avons mis beaucoup d'énergie et d'attention dans l'élaboration du site cette année, merci de ne pas cliquer partout pour tout casser !</p>\n<p><span class=\"conclusion__byline\">– Sacha, Raphaël, et Michael</span></p>"}},"pageContext":{"id":"introduction","type":"custom","next":{"id":"demographics","type":"custom","basePath":"/demographics/"},"basePath":"/introduction/","locale":"fr-FR","localeLabel":"Français","localePath":"/fr"}}