{"data":{"introduction":{"html":"<p><span class=\"first-line\">A <span class=\"first-letter\">JavaScript</span> folyamatosan változik.</span> Új könyvtárak, új keretrendszerek, új nyelvek… Ez egy sokszor szórakoztató és jópofa, de néha kimerítő is tud lenni.</p>\n<p>Itt jön a képbe a State of JavaScript felmérés: idén több mint 20.000 JavaScript fejlesztőt kérdeztünk meg, hogy megértsük mit használnak, mivel elégedettek, és mit szeretnének tanulni. Az eredmény pedig remélhetőleg nagyobb belátást ad a nyelvre, és segít megtalálni a magad útját a JavaScript ökoszisztémában.</p>\n<p>Ha kíváncsi vagy mi változott idén a korábbi felmérésekhez képest,  <a href=\"https://medium.freecodecamp.org/the-state-of-javascript-2018-8322bcc51bd8\">ebben a posztban</a> találod a részleteket.</p>\n<h3>Források</h3>\n<p>Tudjuk, hogy sokan azért követitek ezt a felmérést, hogy megtudjátok mit érdemes tanulni következőnek. A felmérésben itt-ott megosztunk pár hasznos linket amik segítenek eligazodni merre érdemes tovább haladni.</p>\n<p>Megjegyzés: némelyik link fizetett szponzortól származik, de ettől függetlenül biztosíthatunk arról, hogy magas minőségű forrásokról van szó, olyan emberektől akiket ismerünk és tisztelünk, és akik úgy döntöttek, hogy támogatják a projektünket.</p>\n<h3>A csapat</h3>\n<p>A State of JavaScript felmérés készítői és karbantartói:</p>\n<ul>\n<li><a href=\"https://twitter.com/sachagreif\">Sacha Greif</a> (én!): Design, írás, programozás</li>\n<li><a href=\"https://twitter.com/benitteraphael\">Raphael Benitte</a>: Adatelemzés, vizualizáció</li>\n<li><a href=\"https://twitter.com/michaelrambeau\">Michael Rambeau</a>: Írás, egyéb statisztikák</li>\n</ul>\n<p>Ne felejtsd el megnézni az én React/GraphQL Javascript keretrendszeremet, a <a href=\"http://vulcanjs.org\">Vulcan.js</a>-t, Raphael React adat vizualizáló könyvtárát a <a href=\"https://nivo.rocks\">Nivo.js</a>-t és Michael <a href=\"https://bestofjs.org\">Best of JS</a> könyvtár gyűjteményét.</p>\n<h3>Töltsd le a felmérés adatait</h3>\n<p>Az ehhez a felméréshez tartózó adatokat <a href=\"https://www.kaggle.com/sachag/state-of-javascript-2018\">innen tudod letölteni</a>.\nKérlek szólj nekünk ha saját adatvizualizációkat készítesz.</p>\n<h3>Egyéb linkek</h3>\n<ul>\n<li><a href=\"https://stateofjs.com\">State of JavaScript Főoldal</a></li>\n<li><a href=\"https://2016.stateofjs.com/\">2016</a></li>\n<li><a href=\"https://2017.stateofjs.com/\">2017</a></li>\n</ul>\n<h3>Kredit &#x26; Egyéb</h3>\n<p>Az oldal IBM Plex Mono-ba van állítva. A tűz gif innen kölcsönözve: <a href=\"https://animal-jam-roleplay.wikia.com/wiki/File:Pixel-fire-gif-1.gif\">Animal Jam</a>. Kérdésed vagy tanácsod van? Szeretnél hozzáférést a nyers adatokhoz? <a href=\"mailto:hello@stateofjs.com\">Lépj kapcsolatba velünk!</a></p>\n<p>És most lássuk mi történt a JavaScript világában idén!</p>\n<p>Ui.: Sok munkát és gondoskodást fektettünk az oldalba idén, kérünk ne kattintgass mindenfelé is ronts el dolgokat!</p>\n<p><span class=\"conclusion__byline\">– Sacha, Raphaël, és Michael</span></p>"}},"pageContext":{"id":"introduction","type":"custom","next":{"id":"demographics","type":"custom","basePath":"/demographics/"},"basePath":"/introduction/","locale":"hu-HU","localeLabel":"Magyar","localePath":"/hu"}}